load-test.yml
config: 
  target: 'https://news-backend.up.railway.app' 
  phases: 
    - duration: 30 
      arrivalRate: 2 
      name: "Warm up" 
    - duration: 60 
      arrivalRate: 8 
      name: "Ramp up" 
    - duration: 60 
      arrivalRate: 167 
      name: "10K ATTACK!" 
    - duration: 30 
      arrivalRate: 3 
      name: "Cool down" 
 
scenarios: 
  - flow: 
      - get: 
          url: "/api/news"